package test.ex.models.entity;

/*************************************************************************************************************************/
/*                                                                                                                       */
/*                                         			複合キーを扱うために用意したクラス											 */
/*                                                                                                                       */
/*                                                                                                                       */
/*************************************************************************************************************************/

// インポート ------------------------------------------------------------------------------------------------------------
import java.io.Serializable;
import lombok.Data;

@Data	// クラスに対して、Getter,Setter,toString,equals,hashCodeメソッドを自動生成する
public class BuyingHistoryKey implements Serializable {

	private Long lessonId;	// ユーザーが購入したブログのID
}
